/*	Время выполнения, час
Номер 
работы	Бригада 1	Бригада 2	Бригада 3
1   	25	        14	        19
2   	42	        14	        48
3	    5	        47	        49
4   	4	        31	        13
5   	15	        38	        19
6	    22	        14	        27
7   	50	        38	        12
8	    9	        42	        24
9   	5	        25	        39
10	    31	        49	        49
11	    37	        18	        44
12	    33	        43	        30
13	    23	        11	        30
14	    45	        34	        14*/
#include <iostream>

int main() {
    int arr[14][3]={{25, 14, 19}, 
                    {25, 14, 19}, };
    
    
    
    return 0;
}